In [7]:
import pandas as pd
import numpy as np
data=pd.Series([1,2,3,4])
data

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
data=pd.Series([1,2,3,4],index=['a','b','c','d'])
data

a    1
b    2
c    3
d    4
dtype: int64

In [14]:
data.name="numbers"
data

a    1
b    2
c    3
d    4
Name: numbers, dtype: int64

In [12]:
data.shape

(4,)

In [13]:
data.values

array([1, 2, 3, 4], dtype=int64)

In [15]:
data.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [17]:
data[-2]

C:\Users\User\AppData\Local\Temp\ipykernel_21532\2140106112.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data[-2]

3

In [18]:
data['a']

1

In [19]:
data['b']

2

In [29]:
data.iloc[0:5:2],data.loc['a':'d':2]

(a    1
 c    3
 Name: numbers, dtype: int64,
 a    1
 c    3
 Name: numbers, dtype: int64)

In [30]:
data.loc[['a','d']]

a    1
d    4
Name: numbers, dtype: int64

In [31]:
dict={
    "usn":[1,2,3,4],
    "name":["Ramya","raju","priya","lakshmi"],
     "age":[23,29,22,21],
      "branch":["MCA","ITI","CS","SE"]
}
dict

{'usn': [1, 2, 3, 4],
 'name': ['Ramya', 'raju', 'priya', 'lakshmi'],
 'age': [23, 29, 22, 21],
 'branch': ['MCA', 'ITI', 'CS', 'SE']}

In [32]:
df=pd.DataFrame(dict)
df

   usn     name  age branch
0    1    Ramya   23    MCA
1    2     raju   29    ITI
2    3    priya   22     CS
3    4  lakshmi   21     SE

In [33]:
data=pd.read_csv(r"C:\Users\User\Downloads\sample.csv")
data

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8
7,7,108,David,HR,26,48000,2,2022-02-14,Mumbai,3.7
8,8,109,Sara,Finance,38,61000,12,2013-12-01,Delhi,4.3
9,9,110,Arjun,IT,27,54000,4,2020-08-19,Bangalore,4.0
10,10,111,Ravi,HR,33,47000,6,2017-05-23,Mumbai,3.6
11,11,112,Priya,Finance,31,59000,5,2019-09-17,Delhi,4.4
12,12,113,Kunal,IT,45,90000,18,2008-03-11,Bangalore,4.9
13,13,114,Sneha,HR,29,51000,3,2021-07-29,Mumbai,3.5
14,14,115,Vijay,Finance,36,62000,11,2014-01-10,Delhi,4.2
15,15,116,Neha,IT,40,88000,14,2011-10-21,Bangalore,4.7
16,16,117,Amit,HR,34,53000,8,2016-04-05,Mumbai,4.0
17,17,118,Pooja,Finance,30,57000,6,2018-12-12,Delhi,4.1
18,18,119,Rahul,IT,28,56000,4,2020-02-28,Bangalore,3.9
19,19,120,Divya,HR,37,49500,9,2015-06-30,Mumbai,4.3

In [34]:
data.head()

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1

In [35]:
data.head(7)

,Unnamed: 0,EmpID,Name,Department,Age,Salary,Experience,JoiningDate,City,PerformanceScore
0,0,101,Ram,IT,25,50000,2,2021-01-15,Bangalore,4.5
1,1,102,Shyam,HR,30,45000,5,2019-03-10,Mumbai,3.8
2,2,103,Geeta,Finance,28,60000,4,2020-07-22,Delhi,4.2
3,3,104,Anita,IT,35,75000,10,2015-09-30,Bangalore,4.9
4,4,105,Kiran,HR,32,52000,7,2018-06-12,Mumbai,4.1
5,5,106,John,Finance,29,58000,3,2021-11-05,Delhi,3.9
6,6,107,Meena,IT,41,82000,15,2010-04-18,Bangalore,4.8

In [36]:
data.describe()

,Unnamed: 0,EmpID,Age,Salary,Experience,PerformanceScore
count,20.00000,20.00000,20.000000,20.000000,20.000000,20.000000
mean,9.50000,110.50000,32.700000,59875.000000,7.400000,4.190000
std,5.91608,5.91608,5.449288,13388.796377,4.615762,0.415363
min,0.00000,101.00000,25.000000,45000.000000,2.000000,3.500000
25%,4.75000,105.75000,28.750000,50750.000000,4.000000,3.900000
50%,9.50000,110.50000,31.500000,56500.000000,6.000000,4.150000
75%,14.25000,115.25000,36.250000,61250.000000,10.250000,4.425000
max,19.00000,120.00000,45.000000,90000.000000,18.000000,4.900000

In [37]:
data.info

<bound method DataFrame.info of     Unnamed: 0  EmpID   Name Department  Age  Salary  Experience JoiningDate  \
0            0    101    Ram         IT   25   50000           2  2021-01-15
1            1    102  Shyam         HR   30   45000           5  2019-03-10
2            2    103  Geeta    Finance   28   60000           4  2020-07-22
3            3    104  Anita         IT   35   75000          10  2015-09-30
4            4    105  Kiran         HR   32   52000           7  2018-06-12
5            5    106   John    Finance   29   58000           3  2021-11-05
6            6    107  Meena         IT   41   82000          15  2010-04-18
7            7    108  David         HR   26   48000           2  2022-02-14
8            8    109   Sara    Finance   38   61000          12  2013-12-01
9            9    110  Arjun         IT   27   54000           4  2020-08-19
10          10    111   Ravi         HR   33   47000           6  2017-05-23
11          11    112  Priya    Finance   31   59000           5  2019-09-17
12          12    113  Kunal         IT   45   90000          18  2008-03-11
13          13    114  Sneha         HR   29   51000           3  2021-07-29
14          14    115  Vijay    Finance   36   62000          11  2014-01-10
15          15    116   Neha         IT   40   88000          14  2011-10-21
16          16    117   Amit         HR   34   53000           8  2016-04-05
17          17    118  Pooja    Finance   30   57000           6  2018-12-12
18          18    119  Rahul         IT   28   56000           4  2020-02-28
19          19    120  Divya         HR   37   49500           9  2015-06-30

         City  PerformanceScore
0   Bangalore               4.5
1      Mumbai               3.8
2       Delhi               4.2
3   Bangalore               4.9
4      Mumbai               4.1
5       Delhi               3.9
6   Bangalore               4.8
7      Mumbai               3.7
8       Delhi               4.3
9   Bangalore               4.0
10     Mumbai               3.6
11      Delhi               4.4
12  Bangalore               4.9
13     Mumbai               3.5
14      Delhi               4.2
15  Bangalore               4.7
16     Mumbai               4.0
17      Delhi               4.1
18  Bangalore               3.9
19     Mumbai               4.3  >

In [38]:
data.shape

(20, 10)

In [39]:
data.sample

<bound method NDFrame.sample of     Unnamed: 0  EmpID   Name Department  Age  Salary  Experience JoiningDate  \
0            0    101    Ram         IT   25   50000           2  2021-01-15
1            1    102  Shyam         HR   30   45000           5  2019-03-10
2            2    103  Geeta    Finance   28   60000           4  2020-07-22
3            3    104  Anita         IT   35   75000          10  2015-09-30
4            4    105  Kiran         HR   32   52000           7  2018-06-12
5            5    106   John    Finance   29   58000           3  2021-11-05
6            6    107  Meena         IT   41   82000          15  2010-04-18
7            7    108  David         HR   26   48000           2  2022-02-14
8            8    109   Sara    Finance   38   61000          12  2013-12-01
9            9    110  Arjun         IT   27   54000           4  2020-08-19
10          10    111   Ravi         HR   33   47000           6  2017-05-23
11          11    112  Priya    Finance   31   59000           5  2019-09-17
12          12    113  Kunal         IT   45   90000          18  2008-03-11
13          13    114  Sneha         HR   29   51000           3  2021-07-29
14          14    115  Vijay    Finance   36   62000          11  2014-01-10
15          15    116   Neha         IT   40   88000          14  2011-10-21
16          16    117   Amit         HR   34   53000           8  2016-04-05
17          17    118  Pooja    Finance   30   57000           6  2018-12-12
18          18    119  Rahul         IT   28   56000           4  2020-02-28
19          19    120  Divya         HR   37   49500           9  2015-06-30

         City  PerformanceScore
0   Bangalore               4.5
1      Mumbai               3.8
2       Delhi               4.2
3   Bangalore               4.9
4      Mumbai               4.1
5       Delhi               3.9
6   Bangalore               4.8
7      Mumbai               3.7
8       Delhi               4.3
9   Bangalore               4.0
10     Mumbai               3.6
11      Delhi               4.4
12  Bangalore               4.9
13     Mumbai               3.5
14      Delhi               4.2
15  Bangalore               4.7
16     Mumbai               4.0
17      Delhi               4.1
18  Bangalore               3.9
19     Mumbai               4.3  >

In [41]:
data.Name

0       Ram
1     Shyam
2     Geeta
3     Anita
4     Kiran
5      John
6     Meena
7     David
8      Sara
9     Arjun
10     Ravi
11    Priya
12    Kunal
13    Sneha
14    Vijay
15     Neha
16     Amit
17    Pooja
18    Rahul
19    Divya
Name: Name, dtype: object

In [43]:
data[["Name","Department","Salary"]]

     Name Department  Salary
0     Ram         IT   50000
1   Shyam         HR   45000
2   Geeta    Finance   60000
3   Anita         IT   75000
4   Kiran         HR   52000
5    John    Finance   58000
6   Meena         IT   82000
7   David         HR   48000
8    Sara    Finance   61000
9   Arjun         IT   54000
10   Ravi         HR   47000
11  Priya    Finance   59000
12  Kunal         IT   90000
13  Sneha         HR   51000
14  Vijay    Finance   62000
15   Neha         IT   88000
16   Amit         HR   53000
17  Pooja    Finance   57000
18  Rahul         IT   56000
19  Divya         HR   49500

In [44]:
type(data.Name)

pandas.core.series.Series

In [83]:
import numpy as np
import pandas as pd
data1=pd.read_csv("C:\\Users\\User\\Downloads\\test2.csv")
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [57]:
data1.loc[ : ,"Name":"Department"]

      Name   Age Department
0    Alice  25.0         HR
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT
4      Eve  29.0         HR
5    Alice  25.0         HR

In [63]:
data1.loc[1:3,"Name":"Department"]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [64]:
data1.iloc[1:4,1:4]

      Name   Age Department
1      Bob  30.0         IT
2  Charlie  35.0    Finance
3    David   NaN         IT

In [66]:
data1.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"})

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [67]:
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [68]:
data1.rename(columns={"Name":"N","Age":"A","Department":"D","Salary":"S"},inplace=True)

In [69]:
data1

   Unnamed: 0        N     A        D        S
0           0    Alice  25.0       HR  50000.0
1           1      Bob  30.0       IT  60000.0
2           2  Charlie  35.0  Finance  70000.0
3           3    David   NaN       IT  62000.0
4           4      Eve  29.0       HR      NaN
5           5    Alice  25.0       HR  50000.0

In [79]:
data1

         N     A        D        S
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [84]:
data1.drop('Unnamed: 0',axis=1,inplace=True)
data1

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [2]:
import numpy as np
import pandas as pd
data1=pd.read_csv("C:\\Users\\User\\Downloads\\test2.csv")
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David   NaN         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [86]:
data1.drop('Unnamed: 0',axis=1,inplace=True)
data1

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [88]:
data1["updated_salary"]=data1["Salary"]+50000

In [89]:
data1

      Name   Age Department   Salary  updated_salary
0    Alice  25.0         HR  50000.0        100000.0
1      Bob  30.0         IT  60000.0        110000.0
2  Charlie  35.0    Finance  70000.0        120000.0
3    David   NaN         IT  62000.0        112000.0
4      Eve  29.0         HR      NaN             NaN
5    Alice  25.0         HR  50000.0        100000.0

In [90]:
data1["updated_salary2"]=data1["Salary"].map(lambda x:x+10000)

In [91]:
data1

      Name   Age Department   Salary  updated_salary  updated_salary2
0    Alice  25.0         HR  50000.0        100000.0          60000.0
1      Bob  30.0         IT  60000.0        110000.0          70000.0
2  Charlie  35.0    Finance  70000.0        120000.0          80000.0
3    David   NaN         IT  62000.0        112000.0          72000.0
4      Eve  29.0         HR      NaN             NaN              NaN
5    Alice  25.0         HR  50000.0        100000.0          60000.0

In [92]:
type(data1.Age)

pandas.core.series.Series

In [93]:
data1.Age.dtype

dtype('float64')

In [94]:
data1.dropna(inplace=True)

In [95]:
data1

      Name   Age Department   Salary  updated_salary  updated_salary2
0    Alice  25.0         HR  50000.0        100000.0          60000.0
1      Bob  30.0         IT  60000.0        110000.0          70000.0
2  Charlie  35.0    Finance  70000.0        120000.0          80000.0
5    Alice  25.0         HR  50000.0        100000.0          60000.0

In [96]:
data1.Age.astype("int")

0    25
1    30
2    35
5    25
Name: Age, dtype: int32

In [97]:
data1

      Name   Age Department   Salary  updated_salary  updated_salary2
0    Alice  25.0         HR  50000.0        100000.0          60000.0
1      Bob  30.0         IT  60000.0        110000.0          70000.0
2  Charlie  35.0    Finance  70000.0        120000.0          80000.0
5    Alice  25.0         HR  50000.0        100000.0          60000.0

In [98]:
data1["Age"]>25

0    False
1     True
2     True
5    False
Name: Age, dtype: bool

In [99]:
data1[data1["Age"]>25]

      Name   Age Department   Salary  updated_salary  updated_salary2
1      Bob  30.0         IT  60000.0        110000.0          70000.0
2  Charlie  35.0    Finance  70000.0        120000.0          80000.0

In [3]:
data1["Age"]=data1["Age"].fillna(value=data1["Age"].mean())

In [4]:
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR      NaN
5           5    Alice  25.0         HR  50000.0

In [5]:
data1["Salary"]=data1["Salary"].fillna(value=data1["Salary"].mean())

In [6]:
data1

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [7]:
data1["Department"].value_counts()

Department
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [11]:
data1["Age"]=data1["Age"].fillna(method="ffill")
data1["Salary"]=data1["Salary"].fillna(method="bfill")
data1

C:\Users\User\AppData\Local\Temp\ipykernel_69580\1743550497.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data1["Age"]=data1["Age"].fillna(method="ffill")
C:\Users\User\AppData\Local\Temp\ipykernel_69580\1743550497.py:2: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  data1["Salary"]=data1["Salary"].fillna(method="bfill")

   Unnamed: 0     Name   Age Department   Salary
0           0    Alice  25.0         HR  50000.0
1           1      Bob  30.0         IT  60000.0
2           2  Charlie  35.0    Finance  70000.0
3           3    David  28.8         IT  62000.0
4           4      Eve  29.0         HR  58400.0
5           5    Alice  25.0         HR  50000.0

In [13]:
data1["updated_salary"]=data1["Salary"].apply(lambda x:x+500)
data1

   Unnamed: 0     Name   Age Department   Salary  updated_salary
0           0    Alice  25.0         HR  50000.0         50500.0
1           1      Bob  30.0         IT  60000.0         60500.0
2           2  Charlie  35.0    Finance  70000.0         70500.0
3           3    David  28.8         IT  62000.0         62500.0
4           4      Eve  29.0         HR  58400.0         58900.0
5           5    Alice  25.0         HR  50000.0         50500.0

In [18]:
data1["level"]=data1.apply(lambda row:"High" if row["Salary"]>60000 else "Low",axis=1)
data1

   Unnamed: 0     Name   Age Department   Salary  updated_salary level
0           0    Alice  25.0         HR  50000.0         50500.0   Low
1           1      Bob  30.0         IT  60000.0         60500.0   Low
2           2  Charlie  35.0    Finance  70000.0         70500.0  High
3           3    David  28.8         IT  62000.0         62500.0  High
4           4      Eve  29.0         HR  58400.0         58900.0   Low
5           5    Alice  25.0         HR  50000.0         50500.0   Low

In [22]:
data1.groupby("Department")["Salary"].mean()

Department
Finance    70000.0
HR         52800.0
IT         61000.0
Name: Salary, dtype: float64